---
kind: method
id: M:Autodesk.Revit.DB.Electrical.CableTraySizes.GetSizeCount
source: html/3f140e73-ea0e-8d67-7061-63ff73d2de4c.htm
---
# Autodesk.Revit.DB.Electrical.CableTraySizes.GetSizeCount Method

Gets the size count of the cable tray size table.

## Syntax (C#)
```csharp
public int GetSizeCount()
```